Revit 2024 API
DividedSurface.IsSeedNode Method
Reports whether a grid node is a "seed node," a node that is associated with one or more tiles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsSeedNode(
	GridNode gridNode
)
Visual Basic
Public Function IsSeedNode ( _
	gridNode As GridNode _
) As Boolean
Visual C++
public:
bool IsSeedNode(
	GridNode gridNode
)
Parameters
gridNode
Type: Autodesk.Revit.DB.GridNode
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace